IDEA StatiCa Open Model
CheckResSummary.LoadCaseId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
Note: This API is now obsolete.
 Id of Load Case
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[ObsoleteAttribute]
public int LoadCaseId { get; set; }
<ObsoleteAttribute>
Public Property LoadCaseId As Integer
	Get
	Set
public:
[ObsoleteAttribute]
property int LoadCaseId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
CheckResSummary Class
IdeaRS.OpenModel.Connection Namespace